/*************************************************************************
                           Automate  -  description
                             -------------------
    début                : ${date}
    copyright            : (C) 2016 par S.MANKAI
*************************************************************************/

//---------- Interface de la classe <Exp> (fichier Exp.h) ------
#if ! defined ( EXP_H )
#define EXP_H

//--------------------------------------------------- Interfaces utilisées

//------------------------------------------------------------- Constantes 

//------------------------------------------------------------------ Types 

//------------------------------------------------------------------------ 
// Rôle de la classe <Exp>
//
//
//------------------------------------------------------------------------ 

class Exp 
{
//----------------------------------------------------------------- PUBLIC

public:
//----------------------------------------------------- Méthodes publiques
    
    
    void Evaluation(){};
    // type Méthode ( liste de paramètres );
    // Mode d'emploi :
    //
    // Contrat :
    //




//-------------------------------------------- Constructeurs - destructeur
    Exp ( const Exp & unExp );
    // Mode d'emploi (constructeur de copie) :
    //
    // Contrat :
    //

    Exp ( );
    // Mode d'emploi :
    //
    // Contrat :
    //

    virtual ~Exp ( );
    // Mode d'emploi :
    //
    // Contrat :
    //

//------------------------------------------------------------------ PRIVE 

protected:
//----------------------------------------------------- Méthodes protégées

private:
//------------------------------------------------------- Méthodes privées


protected:
//----------------------------------------------------- Attributs protégés

private:
//------------------------------------------------------- Attributs privés
ExpBin gauche;
ExpBin droite;

//---------------------------------------------------------- Classes amies

//-------------------------------------------------------- Classes privées

//----------------------------------------------------------- Types privés

};

//----------------------------------------- Types dépendants de <Automate>

#endif // EXP_H

