#if ! defined ( ID_H )
#define ID_H

//--------------------------------------------------- Interfaces utilisï¿½ï¿½s
#include <string>
#include <list>

#include "Exp.h"
//------------------------------------------------------------- Constantes

//------------------------------------------------------------------ Types

//------------------------------------------------------------------------

//
//
//------------------------------------------------------------------------

 class Id : public Exp
{
//----------------------------------------------------------------- PUBLIC

public:
//----------------------------------------------------- Mï¿½ï¿½thodes publiques
  	std::list<std::string> getListeId();
  	std::string getNomId();
	virtual double evaluation(const std::map<Id,Exp*> & variables);

	string getNomId();

//------------------------------------------------- Surcharge d'op¨¦rateurs
	 bool operator<(const Id & second) const;

//-------------------------------------------- Constructeurs - destructeur
  Id ( const Id & Id );

  Id ( );

  Id (string);

  virtual ~Id ( );

//------------------------------------------------------------------ PRIVE

protected:
//----------------------------------------------------- Mï¿½ï¿½thodes protï¿½ï¿½gï¿½ï¿½es

private:
//------------------------------------------------------- Mï¿½ï¿½thodes privï¿½ï¿½es

protected:
//----------------------------------------------------- Attributs protï¿½ï¿½gï¿½ï¿½s
    string nomId;
private:
//------------------------------------------------------- Attributs privï¿½ï¿½s

//---------------------------------------------------------- Classes amies

//-------------------------------------------------------- Classes privï¿½ï¿½es

//----------------------------------------------------------- Types privï¿½ï¿½s

};

//----------------------------------------- Types dï¿½pendants de <${file_base}>

#endif // ID_H
